Revit 2026 API

# FamilyIsEditable Property

---

True if the family supports editing, false otherwise.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsEditable { get; }
```
```vb
Public ReadOnly Property IsEditable As Boolean
	Get
```
```cpp
public:
property bool IsEditable {
	bool get ();
}
```
```fsharp
member IsEditable : bool with get
```

#### Property Value

Boolean

The family will not be editable if it is in-place, not saveable, or represents the primary family inside a family document.

#### Reference

Family Class

Autodesk.Revit.DB Namespace